-- Test data
-- TODO: remove
INSERT INTO waypoint
    (project_id, ship_id, port_name, port_code, eta, etd, hex_color)
VALUES
    (NULL, 1, 'Санкт-Петербург', 'RULED', '2020-01-01 00:00:00', '2020-01-01 00:00:00', 'E879F9'),
    (NULL, 1, 'Мурманск', 'RUMMK', '2020-01-02 00:00:00', '2020-01-02 00:00:00', '34495E'),
    (NULL, 1, 'Архангельск', 'RUARH', '2020-01-03 00:00:00', '2020-01-03 00:00:00', 'AA00FF'),
    (NULL, 1, 'Астрахань', 'RUASF', '2020-01-04 00:00:00', '2020-01-04 00:00:00', '60A917'),
    (NULL, 1, 'Азов', 'RUAZO', '2020-01-05 00:00:00', '2020-01-05 00:00:00', 'E74C3C');