-- Площадь обледенения поверхности парусности
-- распределенная по теоретическим шпациям, m^2
INSERT INTO icing_area
  (ship_id, name, area_type, area_value, shift_x, bound_x1, bound_x2, bound_type)
VALUES
  (1, 'Надводный борт',           'v', 4.13,  637.5,   -3,   187,  'frame'),
  (1, 'Кормовая часть',           'v', 9.34,  38.39,   10,   19,   'frame'),
  (1, 'Бак с фальшборотом',       'v', 8.23,  59.59,   150,  187,  'frame'),
  (1, 'Комингсы',                 'v', 7.47,  107.9,   25,   149,  'frame'),
  (1, 'Крышки люков',             'v', 8.51,  59.70,   144,  150,  'frame'),
  (1, 'Кран для люковых крышек',  'v', 12.14, 13.53,   -3,   187,  'frame'),
  (1, 'Нос',                      'v', 12.58, 101.14,  151,  176,  'frame'),
  (1, 'Корма',                    'v', 10.13, 18.04,   -3,   10,   'frame'),
  (1, 'Мачта носовая',            'v', 18.92, 0.86,    158,  175,  'frame'),
  (1, 'Мачта кормовая',           'v', 18.22, 1.25,    15,   18,   'frame');
