-- Площадь обледенения поверхности парусности
-- распределенная по теоретическим шпациям, m^2
INSERT INTO icing_area
  (ship_id, name, area_value, area_type, ound_x1, bound_x2, bound_type, unit)
VALUES
  (1, 'Надводный борт', 'v', 637.5, '-3', '187', 'frame', 'm'),
  (1, 'Кормовая часть', 'v', 38.39, '10', '19', 'frame', 'm'),
  (1, 'Бак с фальшборотом', 'v', 59.59, '150', '187', 'frame', 'm'),
  (1, 'Комингсы', 'v', 107.9, '25', '149', 'frame', 'm'),
  (1, 'Крышки люков', 'v', 59.70, '144', '150', 'frame', 'm'),
  (1, 'Кран для люковых крышек', 'v', 13.53, '-3', '187', 'frame', 'm'),
  (1, 'Нос', 'v', 101.14, '151', '176', 'frame', 'm'),
  (1, 'Корма', 'v', 18.04, '-3', '10', 'frame', 'm'),
  (1, 'Мачта носовая', 'v', 0.86, '158', '175', 'frame', 'm'),
  (1, 'Мачта кормовая', 'v', 1.25, '15', '18', 'frame', 'm');
