-- Координаты и параметры отсеков и цистерн.
-- По умолчанию все пустые

TRUNCATE TABLE compartment;

INSERT INTO compartment
  (ship_id, space_id, name, volume_max, density, bound_x1, bound_x2, bound_type, loading_type)
VALUES  
  -- (1, 1, 'Грузовой трюм',   6215.9, 1.025, 25,   151, 'frame', 'cargo'),
  (1, 2, 'Форпик Пр.Б',     58.8,   1.025, 179,  187, 'frame', 'ballast'),
  (1, 3, 'Форпик ЛБ',       58.8,   1.025, 179,  187, 'frame', 'ballast'),
  (1, 4, 'Балласт 1 Пр.Б',  48.7,   1.025, 153,  174, 'frame', 'ballast'),
  (1, 5, 'Балласт 1 ЛБ',    53.2,   1.025, 153,  174, 'frame', 'ballast'),
  (1, 6, 'Балласт 2 Пр.Б',  115.6,  1.025, 135,  153, 'frame', 'ballast'),
  (1, 7, 'Балласт 2 ЛБ',    115.6,  1.025, 135,  153, 'frame', 'ballast'),
  (1, 8, 'Балласт 2 ДД',    96.8,   1.025, 135,  153, 'frame', 'ballast'),
  (1, 9, 'Балласт 3 Пр.Б',  115.6,  1.025, 117,  135, 'frame', 'ballast'),
  (1, 10, 'Балласт 3 ЛБ',   115.6,  1.025, 117,  135, 'frame', 'ballast'),
  (1, 11, 'Балласт 3 ДД',   96.8,   1.025, 117,  135, 'frame', 'ballast'),
  (1, 12, 'Балласт 4 Пр.Б', 186.2,  1.025, 88,   117, 'frame', 'ballast'),
  (1, 13, 'Балласт 4 ЛБ',   186.2,  1.025, 88,   117, 'frame', 'ballast'),
  (1, 14, 'Балласт 4 ДД',   155.9,  1.025, 88,   117, 'frame', 'ballast'),
  (1, 15, 'Балласт 5 Пр.Б', 186.2,  1.025, 59,   88,   'frame', 'ballast'),
  (1, 16, 'Балласт 5 ЛБ',   186.2,  1.025, 59,   88,   'frame', 'ballast'),
  (1, 17, 'Балласт 5 ДД',   155.9,  1.025, 59,   88,   'frame', 'ballast'),
  (1, 18, 'Балласт 6 Пр.Б', 122.0,  1.025, 40,   59,   'frame', 'ballast'),
  (1, 19, 'Балласт 6 ЛБ',   122.0,  1.025, 40,   59,   'frame', 'ballast'),
  (1, 20, 'Балласт 6 ДД',   102.2,  1.025, 40,   59,   'frame', 'ballast'),
  (1, 21, 'Балласт 7 Пр.Б', 113.6,  1.025, 22,   40,   'frame', 'ballast'),
  (1, 22, 'Балласт 7 ЛБ',   113.6,  1.025, 22,   40,   'frame', 'ballast'),
  (1, 23, 'Балласт 7 ДД',   95.1,   1.025, 22,   40,   'frame', 'ballast'),
  (1, 24, 'Цистерна расходного топлива 1 ЛБ',   6.4,  0.86, 6,  10, 'frame', 'store'),
  (1, 25, 'Цистерна расходного топлива 2 ЛБ',   6.4,  0.86, 6,  10, 'frame', 'store'),
  (1, 26, 'Цистерна запасного топлива 1 Пр.Б',  40.7, 0.86, 22, 25, 'frame', 'store'),
  (1, 27, 'Цистерна запасного топлива 2 ЛБ',    40.8, 0.86, 22, 25, 'frame', 'store'),
  (1, 28, 'Цистерна запасного топлива 3 Пр.Б',  63.1, 0.86, 3,  10, 'frame', 'store'),
  (1, 29, 'Цистерна запасного топлива 3 ЛБ',    62.1, 0.86, 3,  10, 'frame', 'store'),
  (1, 30, 'Цистерна переливная ДП',             16.4, 0.86, 17, 22, 'frame', 'store'),
  (1, 31, 'Цистерна расходного топлива АДГ Пр.Б',     1.2,  0.86, 154, 156, 'frame', 'store'),
  (1, 32, 'Цистерна пресной воды 1 ДП (носовая)',     45.1, 1,    157, 161, 'frame', 'store'),
  (1, 33, 'Цистерна пресной воды 2 Пр.Б (кормовая)',  3.9,  1,    10,   12, 'frame', 'store'),
  (1, 34, 'Цистерна питьевой воды 1 ЛБ',  3.7, 1,   155, 159, 'frame', 'store'),
  (1, 35, 'Цистерна питьевой воды 2 ЛБ',  3.7, 1,   55, 159, 'frame', 'store'),
  (1, 36, 'Цистерна запасного масла ГД',  2.8, 0.9, 10, 12, 'frame', 'store'),
  (1, 37, 'Цистерна запасного масла ДГ',  2.8, 0.9, 10, 12, 'frame', 'store'),
  (1, 38, 'Цистерна отработанного масла ЛБ', 4.3, 0.9, 10, 17, 'frame', 'store'),
  (1, 39, 'Цистерна мочевины ДП',         28.2, 1.32, 10, 14, 'frame', 'store'),
  (1, 40, 'Цистерна нефтеостатков ДП',    8.5,  0.86, 10, 17, 'frame', 'store'),
  (1, 41, 'Шламовая цистерна Пр.Б',       2.1,  0.86, 10, 17, 'frame', 'store'),
  (1, 42, 'Сточная цистерна 1 ДП',        15.4, 0.86, 171, 174, 'frame', 'store'),
  (1, 43, 'Сточная цистерна 2 ЛБ',        0.7,  0.86, 10, 12, 'frame', 'store');

INSERT INTO compartment
  (ship_id, space_id, name, volume_max, bound_x1, bound_x2, bound_type, loading_type)
VALUES  
  (1, 1, 'Грузовой трюм',  6215.9,  25,   151, 'frame', 'cargo');

INSERT INTO compartment
  (ship_id, space_id, name, mass, bound_x1, bound_x2, bound_type, mass_shift_x, mass_shift_y, mass_shift_z, loading_type)
VALUES    
  (1, 47, 'Экипаж и багаж',     1.80, 44.31,  46.31,  'm',      -13.884,  -4.46,  7.70, 'store'),
  (1, 48, 'Провизия',           0,    40.21,  42.21,  'm',      -17.984,  4.60,   8.15, 'store'),
  (1, 49, 'Зерновая переборка', 0,    25,     30,     'frame',  -42.64, 0,      4.53, 'cargo'),
  (1, 50, 'Палубный груз',      0,    25,     151,     'frame',  0,      0,      -10.3, 'cargo');

