-- Площадь поверхности парусности, m^2

INSERT INTO vertical_area_strength
  (ship_id, name, value, bound_x1, bound_x2)
VALUES
  (2, 'Надводный борт',         637.5,   -60.994,   59.356),
  (2, 'Кормовая часть',         38.39,   -53.194,   -47.794),
  (2, 'Бак c фальшборотом',     59.59,   37.006,    59.356),
  (2, 'Комингсы',               107.9,   -44.194,   36.356),
  (2, 'Крышки люков',           59.70,   33.106,    37.006),
  (2, 'Кран для люковых крышек',13.53,   -60.994,   59.356),
  (2, 'Нос',                    101.14,  37.656,    52.756),
  (2, 'Корма',                  18.04,   -60.994,   -53.194),
  (2, 'Мачта носовая',          0.86,    41.956,    52.156),
  (2, 'Мачта кормовая',         1.25,    -50.194,   -48.394);
