-- Постоянная нагрузка на судно, распределенная по шпациям
-- обледенение
INSERT INTO load_constant
  (project_id, ship_id, frame_space_index, key, value)
VALUES
  (NULL, 1, 0, 'ice', 3.3925731),
  (NULL, 1, 1, 'ice', 3.3925731),
  (NULL, 1, 2, 'ice', 3.3925731),
  (NULL, 1, 3, 'ice', 3.3925731),
  (NULL, 1, 4, 'ice', 3.3925731),
  (NULL, 1, 5, 'ice', 3.3925731),
  (NULL, 1, 6, 'ice', 3.3925731),
  (NULL, 1, 7, 'ice', 3.3925731),
  (NULL, 1, 8, 'ice', 3.3925731),
  (NULL, 1, 9, 'ice', 3.3925731),
  (NULL, 1, 10, 'ice', 3.3925731),
  (NULL, 1, 11, 'ice', 3.3925731),
  (NULL, 1, 12, 'ice', 3.3925731),
  (NULL, 1, 13, 'ice', 3.3925731),
  (NULL, 1, 14, 'ice', 3.3925731),
  (NULL, 1, 15, 'ice', 3.3925731),
  (NULL, 1, 16, 'ice', 3.3925731),
  (NULL, 1, 17, 'ice', 3.3925731),
  (NULL, 1, 18, 'ice', 3.3925731),
  (NULL, 1, 19, 'ice', 3.3925731);
