DELETE FROM vertical_area_strength WHERE ship_id=2;

INSERT INTO vertical_area_strength
  (ship_id, name, value, bound_x1, bound_x2)
VALUES
  (2, 'Выхлопная труба', 38.762, 0, 3.6),
  (2, 'Рубка', 63.339, 4.8, 10.9),
  (2, 'Кран кормовой', 78.336, 13.77, 44.97),
  (2, 'Кран носовой', 78.336, 65.57, 96.77),
  (2, 'Крышки и комингс кормового трюма', 32.55, 18.18, 71.54),
  (2, 'Крышки и комингс носового трюма', 28.792, 72.98, 120.18),
  (2, 'Ют', 43.421, -3.57, 10.9),
  (2, 'Бак', 38.327, 119.98, 134.47),
  (2, 'Надводный борт (выше 2,001)', 1238.893, -3.57, 134.47);