DELETE FROM vertical_area_strength WHERE ship_id=2;

INSERT INTO vertical_area_strength
  (ship_id, name, value, bound_x1, bound_x2)
VALUES
  (2, 'Выхлопная труба', 38.76, 0.00, 3.60),
  (2, 'Рубка', 63.34, 4.80, 10.90),
  (2, 'Кран кормовой', 78.34, 13.77, 44.97),
  (2, 'Кран носовой', 78.34, 65.57, 96.77),
  (2, 'Крышки и комингс кормового трюма', 32.55, 18.18, 71.54),
  (2, 'Крышки и комингс носового трюма', 28.79, 72.98, 120.18),
  (2, 'Ют', 43.42, -3.57, 10.90),
  (2, 'Бак', 38.33, 119.98, 134.47),
  (2, 'Надводный борт (выше 2.001)', 1238.89, -3.57, 134.47);